### Terraform Plan: `staging/data`
```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.base: Reading...
module.database.random_password.db: Refreshing state... [id=none]
module.database.aws_ssm_parameter.db_password: Refreshing state... [id=/doktori/staging/db/password]
module.database.aws_db_parameter_group.main: Refreshing state... [id=doktori-staging-mysql80]
data.terraform_remote_state.base: Read complete after 2s
module.database.aws_db_subnet_group.main: Refreshing state... [id=doktori-staging-db-subnet-group]
module.database.aws_security_group.rds: Refreshing state... [id=sg-0d9289b53cfc922d5]
module.database.aws_db_instance.main: Refreshing state... [id=db-5M2NLA6GBWRMDW7CCINOFYNI7A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.rds will be created
  + resource "aws_route53_record" "rds" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "db.staging.doktori.internal"
      + records         = [
          + "doktori-staging-mysql.cvqsyou66939.ap-northeast-2.rds.amazonaws.com",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z05264372SUQKKOSEJ541"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```